rigidity
temperature
density
velocity
pressure
elasticity
viscosity
porosity
conductivity
magnetism
luminosity
brittleness
malleability
solubility
permeability
surface tension
compressibility
tensile strength
thermal expansion
electrical resistance
fairness
complexity
coherence
ambiguity
clarity
meaning
relevance
consistency
integrity
legitimacy
authority
purpose
stability
order
chaos
simplicity
precision
accuracy
nuance
abstraction
resilience
fragility
adaptability
inertia
flexibility
rigidity
persistence
volatility
responsiveness
reactivity
trust
dependency
autonomy
reciprocity
loyalty
intimacy
accountability
transparency
solidarity
cooperation
certainty
falsifiability
predictability
credibility
verifiability
interpretability
justifiability
plausibility
reproducibility
reliability
hardness
porousness
buoyancy
friction
torque
momentum
wavelength
frequency
amplitude
polarity
saturation
opacity
reflectivity
turbulence
entropy
equilibrium
resonance
conductance
inductance
capacitance
cohesion
identity
narrative
tradition
consensus
memory
belief
expectation
imagination
attention
concentration
morality
dignity
respect
empathy
compassion
vulnerability
courage
honesty
patience
creativity
tension
rhythm
harmony
dissonance
balance
symmetry
proportion
contrast
continuity
discontinuity
power
influence
control
dominance
submission
resistance
compliance
negotiation
leverage
boundaries
hierarchy
agency
consent
obligation
confidence
doubt
ambivalence
conviction
curiosity
openness
rigour
tolerance
humility
bias
perception
awareness
intuition
rationality
sensitivity
efficiency
productivity
momentum
acceleration
deceleration
growth
decay
regeneration
depletion
scarcity
abundance
permeability
accessibility
exclusivity
uniformity
diversity
redundancy
robustness
scalability
modularity
interdependence
sovereignty
legitimacy
accountability
cohesion
fluidity
porosity
solidity
opacity
translucency
volatility
durability
endurance
longevity
latency
bandwidth
signal clarity
noise tolerance
alignment
coherence
fidelity
resolution
granularity
depth
breadth
reach
connectivity
isolation
mutuality
sustainability
reversibility
irreversibility
plasticity